; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-4-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-4 - location
	p0-11 - location
	p1-5 - location
	p1-7 - location
	p2-4 - location
	p3-7 - location
	p4-9 - location
	p5-11 - location
	p5-12 - location
	p7-10 - location
	p7-11 - location
	p8-7 - location
	p9-0 - location
	p9-6 - location
	p10-8 - location
	p10-11 - location
	p11-1 - location
	p11-3 - location
	p11-6 - location
	p11-9 - location
	p12-2 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s0)
	(at driver3 s4)
	(at driver4 s6)
	(at driver5 s5)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s11)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s8)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s2)
	(at package2 s12)
	(at package3 s0)
	(at package4 s0)
	(at package5 s1)
	(at package6 s1)
	(at package7 s6)
	(at package8 s3)
	(at package9 s10)
	(at package10 s5)
	(at package11 s1)
	(at package12 s4)
	(at package13 s5)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-11)
	(path p0-11 s0)
	(path s11 p0-11)
	(path p0-11 s11)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(path s5 p5-12)
	(path p5-12 s5)
	(path s12 p5-12)
	(path p5-12 s12)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(path s10 p10-11)
	(path p10-11 s10)
	(path s11 p10-11)
	(path p10-11 s11)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-3)
	(path p11-3 s11)
	(path s3 p11-3)
	(path p11-3 s3)
	(path s11 p11-6)
	(path p11-6 s11)
	(path s6 p11-6)
	(path p11-6 s6)
	(path s11 p11-9)
	(path p11-9 s11)
	(path s9 p11-9)
	(path p11-9 s9)
	(path s12 p12-2)
	(path p12-2 s12)
	(path s2 p12-2)
	(path p12-2 s2)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 83)
	(= (time-to-drive s8 s0) 83)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 6)
	(= (time-to-drive s10 s0) 6)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 11)
	(= (time-to-drive s2 s1) 11)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 77)
	(= (time-to-drive s8 s1) 77)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 90)
	(= (time-to-drive s10 s1) 90)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 56)
	(= (time-to-drive s12 s1) 56)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 60)
	(= (time-to-drive s0 s2) 60)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 93)
	(= (time-to-drive s3 s2) 93)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 42)
	(= (time-to-drive s6 s2) 42)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 96)
	(= (time-to-drive s8 s2) 96)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 14)
	(= (time-to-drive s10 s2) 14)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 39)
	(= (time-to-drive s11 s2) 39)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 1)
	(= (time-to-drive s0 s4) 1)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 31)
	(= (time-to-drive s3 s4) 31)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 71)
	(= (time-to-drive s6 s4) 71)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 74)
	(= (time-to-drive s11 s4) 74)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 68)
	(= (time-to-drive s12 s4) 68)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 49)
	(= (time-to-drive s0 s6) 49)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 22)
	(= (time-to-drive s8 s6) 22)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 49)
	(= (time-to-drive s10 s6) 49)
	(link s6 s12)
	(link s12 s6)
	(= (time-to-drive s6 s12) 5)
	(= (time-to-drive s12 s6) 5)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 47)
	(= (time-to-drive s0 s7) 47)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 31)
	(= (time-to-drive s1 s7) 31)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 81)
	(= (time-to-drive s3 s7) 81)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 58)
	(= (time-to-drive s5 s7) 58)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 23)
	(= (time-to-drive s10 s7) 23)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 19)
	(= (time-to-drive s4 s8) 19)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 63)
	(= (time-to-drive s5 s8) 63)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 74)
	(= (time-to-drive s9 s8) 74)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 47)
	(= (time-to-drive s5 s9) 47)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 9)
	(= (time-to-drive s10 s9) 9)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 56)
	(= (time-to-drive s4 s10) 56)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 53)
	(= (time-to-drive s12 s10) 53)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 20)
	(= (time-to-drive s3 s11) 20)
	(link s11 s5)
	(link s5 s11)
	(= (time-to-drive s11 s5) 33)
	(= (time-to-drive s5 s11) 33)
	(link s11 s6)
	(link s6 s11)
	(= (time-to-drive s11 s6) 42)
	(= (time-to-drive s6 s11) 42)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 75)
	(= (time-to-drive s9 s11) 75)
	(link s12 s7)
	(link s7 s12)
	(= (time-to-drive s12 s7) 92)
	(= (time-to-drive s7 s12) 92)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 34)
	(= (time-to-drive s11 s12) 34)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver4 s12)
	(at driver5 s11)
	(at truck1 s7)
	(at truck2 s2)
	(at truck3 s1)
	(at truck4 s12)
	(at package1 s10)
	(at package2 s3)
	(at package3 s3)
	(at package4 s7)
	(at package5 s1)
	(at package6 s6)
	(at package7 s9)
	(at package8 s8)
	(at package9 s11)
	(at package10 s6)
	(at package11 s8)
	(at package12 s8)
	(at package13 s9)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver3 s4 p2-4)
   deleted: (at driver3 s4)
   added: (at driver3 p2-4)
   goals met: 1 of 20
2. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 20
3. (walk driver3 p2-4 s2)
   deleted: (at driver3 p2-4)
   added: (at driver3 s2)
   goals met: 1 of 20
4. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 20
5. (drive-truck truck1 s2 s8 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (fuel-used) from 0 to 1056
   goals met: 1 of 20
6. (walk driver5 s5 p5-11)
   deleted: (at driver5 s5)
   added: (at driver5 p5-11)
   goals met: 1 of 20
7. (walk driver5 p5-11 s11)
   deleted: (at driver5 p5-11)
   added: (at driver5 s11)
   goals met: 2 of 20
8. (drive-truck truck1 s8 s4 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   changed: (fuel-used) from 1056 to 1265
   goals met: 2 of 20
9. (load-truck package12 truck1 s4)
   deleted: (at package12 s4)
   added: (in package12 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 20
10. (drive-truck truck1 s4 s8 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s8)
   changed: (fuel-used) from 1265 to 1512
   goals met: 2 of 20
11. (walk driver5 s11 p11-3)
   deleted: (at driver5 s11)
   added: (at driver5 p11-3)
   goals met: 1 of 20
12. (unload-truck package12 truck1 s8)
   deleted: (in package12 truck1)
   added: (at package12 s8)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 2 of 20
13. (drive-truck truck1 s8 s6 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s6)
   changed: (fuel-used) from 1512 to 1754
   goals met: 2 of 20
14. (load-truck package7 truck1 s6)
   deleted: (at package7 s6)
   added: (in package7 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 20
15. (drive-truck truck1 s6 s0 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   changed: (fuel-used) from 1754 to 2391
   goals met: 2 of 20
16. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 2 of 20
17. (drive-truck truck1 s0 s10 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s10)
   changed: (fuel-used) from 2391 to 2487
   goals met: 2 of 20
18. (load-truck package9 truck1 s10)
   deleted: (at package9 s10)
   added: (in package9 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 2 of 20
19. (unload-truck package1 truck1 s10)
   deleted: (in package1 truck1)
   added: (at package1 s10)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 3 of 20
20. (drive-truck truck1 s10 s0 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s0)
   changed: (fuel-used) from 2487 to 2583
   goals met: 3 of 20
21. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 3 of 20
22. (drive-truck truck1 s0 s8 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s8)
   changed: (fuel-used) from 2583 to 4243
   goals met: 3 of 20
23. (walk driver5 p11-3 s3)
   deleted: (at driver5 p11-3)
   added: (at driver5 s3)
   goals met: 3 of 20
24. (board-truck driver5 truck3 s3)
   deleted: (at driver5 s3) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 3 of 20
25. (load-truck package8 truck3 s3)
   deleted: (at package8 s3)
   added: (in package8 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 20
26. (walk driver4 s6 p11-6)
   deleted: (at driver4 s6)
   added: (at driver4 p11-6)
   goals met: 3 of 20
27. (drive-truck truck3 s3 s11 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s11)
   changed: (fuel-used) from 4243 to 4463
   goals met: 3 of 20
28. (walk driver4 p11-6 s11)
   deleted: (at driver4 p11-6)
   added: (at driver4 s11)
   goals met: 3 of 20
29. (disembark-truck driver5 truck3 s11)
   deleted: (driving driver5 truck3)
   added: (at driver5 s11) (empty truck3)
   goals met: 4 of 20
30. (board-truck driver4 truck3 s11)
   deleted: (at driver4 s11) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 4 of 20
31. (drive-truck truck3 s11 s12 driver4)
   deleted: (at truck3 s11)
   added: (at truck3 s12)
   changed: (fuel-used) from 4463 to 4837
   goals met: 4 of 20
32. (load-truck package2 truck3 s12)
   deleted: (at package2 s12)
   added: (in package2 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 4 of 20
33. (drive-truck truck3 s12 s4 driver4)
   deleted: (at truck3 s12)
   added: (at truck3 s4)
   changed: (fuel-used) from 4837 to 5721
   goals met: 4 of 20
34. (drive-truck truck1 s8 s5 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (fuel-used) from 5721 to 6981
   goals met: 4 of 20
35. (load-truck package13 truck1 s5)
   deleted: (at package13 s5)
   added: (in package13 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 4 of 20
36. (load-truck package10 truck1 s5)
   deleted: (at package10 s5)
   added: (in package10 truck1)
   changed: (load truck1) from 5 to 6, (fuel-per-minute truck1) from 25 to 31
   goals met: 4 of 20
37. (drive-truck truck1 s5 s11 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s11)
   changed: (fuel-used) from 6981 to 8004
   goals met: 4 of 20
38. (drive-truck truck3 s4 s8 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s8)
   changed: (fuel-used) from 8004 to 8251
   goals met: 4 of 20
39. (unload-truck package8 truck3 s8)
   deleted: (in package8 truck3)
   added: (at package8 s8)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 5 of 20
40. (unload-truck package9 truck1 s11)
   deleted: (in package9 truck1)
   added: (at package9 s11)
   changed: (load truck1) from 6 to 5, (fuel-per-minute truck1) from 31 to 25
   goals met: 6 of 20
41. (drive-truck truck1 s11 s3 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s3)
   changed: (fuel-used) from 8251 to 8751
   goals met: 6 of 20
42. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 7 of 20
43. (disembark-truck driver4 truck3 s8)
   deleted: (driving driver4 truck3)
   added: (at driver4 s8) (empty truck3)
   goals met: 7 of 20
44. (drive-truck truck1 s3 s7 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   changed: (fuel-used) from 8751 to 10371
   goals met: 8 of 20
45. (disembark-truck driver3 truck1 s7)
   deleted: (driving driver3 truck1)
   added: (at driver3 s7) (empty truck1)
   goals met: 8 of 20
46. (unload-truck package4 truck1 s7)
   deleted: (in package4 truck1)
   added: (at package4 s7)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 9 of 20
47. (walk driver2 s0 p0-4)
   deleted: (at driver2 s0)
   added: (at driver2 p0-4)
   goals met: 9 of 20
48. (board-truck driver4 truck3 s8)
   deleted: (at driver4 s8) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 9 of 20
49. (board-truck driver3 truck1 s7)
   deleted: (at driver3 s7) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 9 of 20
50. (walk driver2 p0-4 s4)
   deleted: (at driver2 p0-4)
   added: (at driver2 s4)
   goals met: 9 of 20
51. (drive-truck truck1 s7 s10 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s10)
   changed: (fuel-used) from 10371 to 10739
   goals met: 8 of 20
52. (disembark-truck driver4 truck3 s8)
   deleted: (driving driver4 truck3)
   added: (at driver4 s8) (empty truck3)
   goals met: 8 of 20
53. (board-truck driver4 truck4 s8)
   deleted: (at driver4 s8) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 8 of 20
54. (disembark-truck driver3 truck1 s10)
   deleted: (driving driver3 truck1)
   added: (at driver3 s10) (empty truck1)
   goals met: 8 of 20
55. (unload-truck package2 truck3 s8)
   deleted: (in package2 truck3)
   added: (at package2 s8)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 20
56. (load-truck package2 truck4 s8)
   deleted: (at package2 s8)
   added: (in package2 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 8 of 20
57. (board-truck driver3 truck1 s10)
   deleted: (at driver3 s10) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 20
58. (drive-truck truck1 s10 s7 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s7)
   changed: (fuel-used) from 10739 to 11107
   goals met: 9 of 20
59. (drive-truck truck4 s8 s4 driver4)
   deleted: (at truck4 s8)
   added: (at truck4 s4)
   changed: (fuel-used) from 11107 to 11316
   goals met: 9 of 20
60. (drive-truck truck1 s7 s1 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   changed: (fuel-used) from 11316 to 11812
   goals met: 8 of 20
61. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 8 of 20
62. (load-truck package11 truck1 s1)
   deleted: (at package11 s1)
   added: (in package11 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 8 of 20
63. (drive-truck truck1 s1 s7 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   changed: (fuel-used) from 11812 to 12587
   goals met: 9 of 20
64. (disembark-truck driver4 truck4 s4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s4) (empty truck4)
   goals met: 9 of 20
65. (drive-truck truck1 s7 s5 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   changed: (fuel-used) from 12587 to 14037
   goals met: 8 of 20
66. (drive-truck truck1 s5 s9 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s9)
   changed: (fuel-used) from 14037 to 15212
   goals met: 8 of 20
67. (unload-truck package13 truck1 s9)
   deleted: (in package13 truck1)
   added: (at package13 s9)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 9 of 20
68. (unload-truck package7 truck1 s9)
   deleted: (in package7 truck1)
   added: (at package7 s9)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 10 of 20
69. (board-truck driver2 truck4 s4)
   deleted: (at driver2 s4) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 20
70. (drive-truck truck4 s4 s3 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (fuel-used) from 15212 to 15553
   goals met: 10 of 20
71. (unload-truck package2 truck4 s3)
   deleted: (in package2 truck4)
   added: (at package2 s3)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 11 of 20
72. (drive-truck truck1 s9 s8 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (fuel-used) from 15553 to 16737
   goals met: 11 of 20
73. (unload-truck package11 truck1 s8)
   deleted: (in package11 truck1)
   added: (at package11 s8)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 12 of 20
74. (drive-truck truck1 s8 s5 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (fuel-used) from 16737 to 17556
   goals met: 12 of 20
75. (drive-truck truck4 s3 s4 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   changed: (fuel-used) from 17556 to 17866
   goals met: 12 of 20
76. (drive-truck truck1 s5 s7 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (fuel-used) from 17866 to 18620
   goals met: 13 of 20
77. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 13 of 20
78. (board-truck driver4 truck4 s4)
   deleted: (at driver4 s4) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 13 of 20
79. (board-truck driver5 truck2 s11)
   deleted: (at driver5 s11) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 12 of 20
80. (drive-truck truck1 s7 s10 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s10)
   changed: (fuel-used) from 18620 to 18919
   goals met: 11 of 20
81. (drive-truck truck4 s4 s12 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s12)
   changed: (fuel-used) from 18919 to 19599
   goals met: 12 of 20
82. (disembark-truck driver4 truck4 s12)
   deleted: (driving driver4 truck4)
   added: (at driver4 s12) (empty truck4)
   goals met: 13 of 20
83. (drive-truck truck1 s10 s6 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s6)
   changed: (fuel-used) from 19599 to 20236
   goals met: 13 of 20
84. (unload-truck package6 truck1 s6)
   deleted: (in package6 truck1)
   added: (at package6 s6)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 14 of 20
85. (unload-truck package10 truck1 s6)
   deleted: (in package10 truck1)
   added: (at package10 s6)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 15 of 20
86. (drive-truck truck1 s6 s0 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   changed: (fuel-used) from 20236 to 20726
   goals met: 15 of 20
87. (drive-truck truck1 s0 s7 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (fuel-used) from 20726 to 21196
   goals met: 16 of 20
88. (disembark-truck driver3 truck1 s7)
   deleted: (driving driver3 truck1)
   added: (at driver3 s7) (empty truck1)
   goals met: 16 of 20
89. (walk driver3 s7 p8-7)
   deleted: (at driver3 s7)
   added: (at driver3 p8-7)
   goals met: 16 of 20
90. (walk driver3 p8-7 s8)
   deleted: (at driver3 p8-7)
   added: (at driver3 s8)
   goals met: 16 of 20
91. (board-truck driver3 truck3 s8)
   deleted: (at driver3 s8) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 16 of 20
92. (drive-truck truck3 s8 s1 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   changed: (fuel-used) from 21196 to 21966
   goals met: 17 of 20
93. (drive-truck truck2 s11 s4 driver5)
   deleted: (at truck2 s11)
   added: (at truck2 s4)
   changed: (fuel-used) from 21966 to 22706
   goals met: 17 of 20
94. (disembark-truck driver5 truck2 s4)
   deleted: (driving driver5 truck2)
   added: (at driver5 s4) (empty truck2)
   goals met: 17 of 20
95. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 17 of 20
96. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 22706 to 23016
   goals met: 17 of 20
97. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 23016 to 23946
   goals met: 18 of 20
98. (walk driver5 s4 p4-9)
   deleted: (at driver5 s4)
   added: (at driver5 p4-9)
   goals met: 18 of 20
99. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 23946 to 24876
   goals met: 17 of 20
100. (drive-truck truck2 s3 s11 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s11)
   changed: (fuel-used) from 24876 to 25076
   goals met: 17 of 20
101. (disembark-truck driver2 truck2 s11)
   deleted: (driving driver2 truck2)
   added: (at driver2 s11) (empty truck2)
   goals met: 17 of 20
102. (walk driver2 s11 p11-3)
   deleted: (at driver2 s11)
   added: (at driver2 p11-3)
   goals met: 17 of 20
103. (walk driver2 p11-3 s3)
   deleted: (at driver2 p11-3)
   added: (at driver2 s3)
   goals met: 18 of 20
104. (walk driver1 s5 p5-11)
   deleted: (at driver1 s5)
   added: (at driver1 p5-11)
   goals met: 18 of 20
105. (walk driver5 p4-9 s9)
   deleted: (at driver5 p4-9)
   added: (at driver5 s9)
   goals met: 18 of 20
106. (walk driver1 p5-11 s11)
   deleted: (at driver1 p5-11)
   added: (at driver1 s11)
   goals met: 18 of 20
107. (walk driver5 s9 p11-9)
   deleted: (at driver5 s9)
   added: (at driver5 p11-9)
   goals met: 18 of 20
108. (walk driver5 p11-9 s11)
   deleted: (at driver5 p11-9)
   added: (at driver5 s11)
   goals met: 19 of 20
109. (board-truck driver1 truck2 s11)
   deleted: (at driver1 s11) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 19 of 20
110. (drive-truck truck2 s11 s2 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s2)
   changed: (fuel-used) from 25076 to 25466
   goals met: 20 of 20
